[Killed] ArrowFunction
src/domain/item-grouping.ts:13:25
   readonly neededCount: number;
 };
 
-const createAreaGroup = (area: HouseArea, items: TripItem[]): AreaGroup => ({
-  area,
-  items,
-  totalCount: items.length,
-  neededCount: items.filter((item) => item.needed).length,
-});
+const createAreaGroup = () => undefined;
 
 export type SectionGroup = {
killedBy: WS-1: Maria signs out and returns to the login screen takes Maria from the authenticated shell back to the login screen when she taps Sign out
statusReason: Error: Unable to find node on an unmounted component.

[Killed] ArrowFunction
src/domain/item-grouping.ts:17:29
   area,
   items,
   totalCount: items.length,
-  neededCount: items.filter((item) => item.needed).length,
+  neededCount: items.filter(() => undefined).length,
 });
 
killedBy: US-07: Skip Staple This Trip skips a staple without removing from the library
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
src/domain/item-grouping.ts:17:16
   area,
   items,
   totalCount: items.length,
-  neededCount: items.filter((item) => item.needed).length,
+  neededCount: items.length,
 });
 
killedBy: US-07: Skip Staple This Trip skips a staple without removing from the library
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ArrowFunction
src/domain/item-grouping.ts:49:31
 // pure (no throw) while making the failure mode deterministic and visible
 // (unknown items appear in a stable, low-priority slot) rather than masked at
 // position 0.
-const compareItemsInSection = (
-  indexOf: Map<TripItem, number>,
-  unknownIndex: number,
-) => (a: TripItem, b: TripItem): number => {
-  const aisleA = a.storeLocation.aisleNumber;
-  const aisleB = b.storeLocation.aisleNumber;
-
-  if (aisleA !== null && aisleB !== null && aisleA !== aisleB) {
-    return aisleA - aisleB;
-  }
-  if (aisleA === null && aisleB !== null) return 1;
-  if (aisleA !== null && aisleB === null) return -1;
-
-  // Equal aisle (both numeric-equal or both null): preserve input order.
-  return (indexOf.get(a) ?? unknownIndex) - (indexOf.get(b) ?? unknownIndex);
-};
+const compareItemsInSection = () => undefined;
 
 const createSectionGroup = (section: string, items: TripItem[]): SectionGroup => ({
killedBy: US-02: Null aisle items sort last within a section places aisle-numbered items before null-aisle items inside a single section
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Bread",
    "Pasta",

[Killed] BlockStatement
src/domain/item-grouping.ts:52:44
 const compareItemsInSection = (
   indexOf: Map<TripItem, number>,
   unknownIndex: number,
-) => (a: TripItem, b: TripItem): number => {
-  const aisleA = a.storeLocation.aisleNumber;
-  const aisleB = b.storeLocation.aisleNumber;
-
-  if (aisleA !== null && aisleB !== null && aisleA !== aisleB) {
-    return aisleA - aisleB;
-  }
-  if (aisleA === null && aisleB !== null) return 1;
-  if (aisleA !== null && aisleB === null) return -1;
-
-  // Equal aisle (both numeric-equal or both null): preserve input order.
-  return (indexOf.get(a) ?? unknownIndex) - (indexOf.get(b) ?? unknownIndex);
-};
+) => (a: TripItem, b: TripItem): number => {};
 
 const createSectionGroup = (section: string, items: TripItem[]): SectionGroup => ({
killedBy: US-02: Null aisle items sort last within a section places aisle-numbered items before null-aisle items inside a single section
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Bread",
    "Pasta",

[Killed] EqualityOperator
src/domain/item-grouping.ts:56:26
   const aisleA = a.storeLocation.aisleNumber;
   const aisleB = b.storeLocation.aisleNumber;
 
-  if (aisleA !== null && aisleB !== null && aisleA !== aisleB) {
+  if (aisleA !== null && aisleB === null && aisleA !== aisleB) {
     return aisleA - aisleB;
   }
killedBy: groupBySection orders items within a section by aisleNumber ascending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "Soap",
    "Bread",

[Killed] ConditionalExpression
src/domain/item-grouping.ts:56:26
   const aisleA = a.storeLocation.aisleNumber;
   const aisleB = b.storeLocation.aisleNumber;
 
-  if (aisleA !== null && aisleB !== null && aisleA !== aisleB) {
+  if (aisleA !== null && true && aisleA !== aisleB) {
     return aisleA - aisleB;
   }
killedBy: US-02: Null aisle items sort last within a section places aisle-numbered items before null-aisle items inside a single section
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Bread",
    "Pasta",

[Killed] ArithmeticOperator
src/domain/item-grouping.ts:57:12
   const aisleB = b.storeLocation.aisleNumber;
 
   if (aisleA !== null && aisleB !== null && aisleA !== aisleB) {
-    return aisleA - aisleB;
+    return aisleA + aisleB;
   }
   if (aisleA === null && aisleB !== null) return 1;
killedBy: groupBySection orders items within a section by aisleNumber ascending
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "Soap",
    "Bread",

[Killed] ConditionalExpression
src/domain/item-grouping.ts:59:7
   if (aisleA !== null && aisleB !== null && aisleA !== aisleB) {
     return aisleA - aisleB;
   }
-  if (aisleA === null && aisleB !== null) return 1;
+  if (true) return 1;
   if (aisleA !== null && aisleB === null) return -1;
 
killedBy: groupBySection orders items with null aisleNumber after numbered aisles within the same section
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "Bulk Bin Oats",
    "Bread",

[Survived] ConditionalExpression
src/domain/item-grouping.ts:59:7
   if (aisleA !== null && aisleB !== null && aisleA !== aisleB) {
     return aisleA - aisleB;
   }
-  if (aisleA === null && aisleB !== null) return 1;
+  if (false) return 1;
   if (aisleA !== null && aisleB === null) return -1;
 

[Killed] ConditionalExpression
src/domain/item-grouping.ts:60:7
     return aisleA - aisleB;
   }
   if (aisleA === null && aisleB !== null) return 1;
-  if (aisleA !== null && aisleB === null) return -1;
+  if (false) return -1;
 
   // Equal aisle (both numeric-equal or both null): preserve input order.
killedBy: groupBySection orders items with null aisleNumber after numbered aisles within the same section
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "Bulk Bin Oats",
    "Bread",

[Killed] ConditionalExpression
src/domain/item-grouping.ts:60:7
     return aisleA - aisleB;
   }
   if (aisleA === null && aisleB !== null) return 1;
-  if (aisleA !== null && aisleB === null) return -1;
+  if (true) return -1;
 
   // Equal aisle (both numeric-equal or both null): preserve input order.
killedBy: partitionSectionByAisle item input order preserved inside each aisle sub-group
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Bread",
    "Pasta",

[Killed] LogicalOperator
src/domain/item-grouping.ts:63:46
   if (aisleA !== null && aisleB === null) return -1;
 
   // Equal aisle (both numeric-equal or both null): preserve input order.
-  return (indexOf.get(a) ?? unknownIndex) - (indexOf.get(b) ?? unknownIndex);
+  return (indexOf.get(a) ?? unknownIndex) - (indexOf.get(b) && unknownIndex);
 };
 
killedBy: groupBySection preserves input order as a stable secondary order for items with the same aisleNumber
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "Pasta",
-   "Rice",

[Survived] LogicalOperator
src/domain/item-grouping.ts:63:11
   if (aisleA !== null && aisleB === null) return -1;
 
   // Equal aisle (both numeric-equal or both null): preserve input order.
-  return (indexOf.get(a) ?? unknownIndex) - (indexOf.get(b) ?? unknownIndex);
+  return (indexOf.get(a) && unknownIndex) - (indexOf.get(b) ?? unknownIndex);
 };
 

[Killed] ArrowFunction
src/domain/item-grouping.ts:66:28
   return (indexOf.get(a) ?? unknownIndex) - (indexOf.get(b) ?? unknownIndex);
 };
 
-const createSectionGroup = (section: string, items: TripItem[]): SectionGroup => ({
-  section,
-  items,
-  totalCount: items.length,
-  checkedCount: items.filter((item) => item.checked).length,
-});
+const createSectionGroup = () => undefined;
 
 export const groupBySection = (items: TripItem[]): SectionGroup[] => {
killedBy: sweep mode shows one-offs section separately renders One-offs section with one-off items in sweep mode
statusReason: TypeError: Cannot read properties of undefined (reading 'section')

[Killed] ArrowFunction
src/domain/item-grouping.ts:70:30
   section,
   items,
   totalCount: items.length,
-  checkedCount: items.filter((item) => item.checked).length,
+  checkedCount: items.filter(() => undefined).length,
 });
 
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Unable to find an element with text: 1 of 3

<View
  testID="safe-area"
>
  <View>
    <View
      accessible={true}

[Killed] MethodExpression
src/domain/item-grouping.ts:70:17
   section,
   items,
   totalCount: items.length,
-  checkedCount: items.filter((item) => item.checked).length,
+  checkedCount: items.length,
 });
 
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Unable to find an element with text: 1 of 3

<View
  testID="safe-area"
>
  <View>
    <View
      accessible={true}

[Killed] BlockStatement
src/domain/item-grouping.ts:73:70
   checkedCount: items.filter((item) => item.checked).length,
 });
 
-export const groupBySection = (items: TripItem[]): SectionGroup[] => {
-  if (items.length === 0) return [];
-
-  const indexOf = new Map<TripItem, number>(items.map((item, i) => [item, i]));
-
-  // Bucket items by section, preserving first-seen section order.
-  const sectionOrder: string[] = [];
-  const itemsBySection = new Map<string, TripItem[]>();
-  for (const item of items) {
-    const section = item.storeLocation.section;
-    if (!itemsBySection.has(section)) {
-      sectionOrder.push(section);
-      itemsBySection.set(section, []);
-    }
-    itemsBySection.get(section)!.push(item);
-  }
-
-  const compare = compareItemsInSection(indexOf, items.length);
-
-  return sectionOrder.map((section) => {
-    const sectionItems = [...itemsBySection.get(section)!].sort(compare);
-    return createSectionGroup(section, sectionItems);
-  });
-};
+export const groupBySection = (items: TripItem[]): SectionGroup[] => {};
 
 const createAisleSubGroup = (
killedBy: groupBySection returns empty array for empty items
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ConditionalExpression
src/domain/item-grouping.ts:74:7
 });
 
 export const groupBySection = (items: TripItem[]): SectionGroup[] => {
-  if (items.length === 0) return [];
+  if (true) return [];
 
   const indexOf = new Map<TripItem, number>(items.map((item, i) => [item, i]));
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Unable to find an element with text: Whole milk

<View
  testID="safe-area"
>
  <View>
    <View
      accessible={true}

[Killed] EqualityOperator
src/domain/item-grouping.ts:74:7
 });
 
 export const groupBySection = (items: TripItem[]): SectionGroup[] => {
-  if (items.length === 0) return [];
+  if (items.length !== 0) return [];
 
   const indexOf = new Map<TripItem, number>(items.map((item, i) => [item, i]));
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Unable to find an element with text: Whole milk

<View
  testID="safe-area"
>
  <View>
    <View
      accessible={true}

[Killed] ArrowFunction
src/domain/item-grouping.ts:76:55
 export const groupBySection = (items: TripItem[]): SectionGroup[] => {
   if (items.length === 0) return [];
 
-  const indexOf = new Map<TripItem, number>(items.map((item, i) => [item, i]));
+  const indexOf = new Map<TripItem, number>(items.map(() => undefined));
 
   // Bucket items by section, preserving first-seen section order.
killedBy: US-08: Area completion and sweep progress in UI shows completion badge and progress bar after marking area done
statusReason: TypeError: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/domain/item-grouping.ts:79:34
   const indexOf = new Map<TripItem, number>(items.map((item, i) => [item, i]));
 
   // Bucket items by section, preserving first-seen section order.
-  const sectionOrder: string[] = [];
+  const sectionOrder: string[] = ["Stryker was here"];
   const itemsBySection = new Map<string, TripItem[]>();
   for (const item of items) {
killedBy: US-08: Area completion and sweep progress in UI shows completion badge and progress bar after marking area done
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] BlockStatement
src/domain/item-grouping.ts:81:29
   // Bucket items by section, preserving first-seen section order.
   const sectionOrder: string[] = [];
   const itemsBySection = new Map<string, TripItem[]>();
-  for (const item of items) {
-    const section = item.storeLocation.section;
-    if (!itemsBySection.has(section)) {
-      sectionOrder.push(section);
-      itemsBySection.set(section, []);
-    }
-    itemsBySection.get(section)!.push(item);
-  }
+  for (const item of items) {}
 
   const compare = compareItemsInSection(indexOf, items.length);
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Unable to find an element with text: Whole milk

<View
  testID="safe-area"
>
  <View>
    <View
      accessible={true}

[Killed] ConditionalExpression
src/domain/item-grouping.ts:83:9
   const itemsBySection = new Map<string, TripItem[]>();
   for (const item of items) {
     const section = item.storeLocation.section;
-    if (!itemsBySection.has(section)) {
+    if (true) {
       sectionOrder.push(section);
       itemsBySection.set(section, []);
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Unable to find an element with text: Whole milk

<View
  testID="safe-area"
>
  <View>
    <View
      accessible={true}

[Killed] BooleanLiteral
src/domain/item-grouping.ts:83:9
   const itemsBySection = new Map<string, TripItem[]>();
   for (const item of items) {
     const section = item.storeLocation.section;
-    if (!itemsBySection.has(section)) {
+    if (itemsBySection.has(section)) {
       sectionOrder.push(section);
       itemsBySection.set(section, []);
killedBy: US-08: Area completion and sweep progress in UI shows completion badge and progress bar after marking area done
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrayDeclaration
src/domain/item-grouping.ts:85:35
     const section = item.storeLocation.section;
     if (!itemsBySection.has(section)) {
       sectionOrder.push(section);
-      itemsBySection.set(section, []);
+      itemsBySection.set(section, ["Stryker was here"]);
     }
     itemsBySection.get(section)!.push(item);
killedBy: US-08: Area completion and sweep progress in UI shows completion badge and progress bar after marking area done
statusReason: TypeError: Cannot read properties of undefined (reading 'aisleNumber')

[Killed] BlockStatement
src/domain/item-grouping.ts:92:40
 
   const compare = compareItemsInSection(indexOf, items.length);
 
-  return sectionOrder.map((section) => {
-    const sectionItems = [...itemsBySection.get(section)!].sort(compare);
-    return createSectionGroup(section, sectionItems);
-  });
+  return sectionOrder.map((section) => {});
 };
 
killedBy: US-08: Area completion and sweep progress in UI shows completion badge and progress bar after marking area done
statusReason: TypeError: Cannot read properties of undefined (reading 'section')

[Killed] MethodExpression
src/domain/item-grouping.ts:93:26
   const compare = compareItemsInSection(indexOf, items.length);
 
   return sectionOrder.map((section) => {
-    const sectionItems = [...itemsBySection.get(section)!].sort(compare);
+    const sectionItems = [...itemsBySection.get(section)!];
     return createSectionGroup(section, sectionItems);
   });
killedBy: US-02: Null aisle items sort last within a section places aisle-numbered items before null-aisle items inside a single section
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
-   "Bread",
    "Pasta",

[Killed] ArrowFunction
src/domain/item-grouping.ts:98:29
   });
 };
 
-const createAisleSubGroup = (
-  aisleKey: AisleKey,
-  items: TripItem[],
-): AisleSubGroup => ({
-  aisleKey,
-  items,
-  totalCount: items.length,
-  checkedCount: items.filter((item) => item.checked).length,
-});
+const createAisleSubGroup = () => undefined;
 
 // Bucket items by aisleKey, preserving input order within each bucket.
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: TypeError: Cannot read properties of undefined (reading 'aisleKey')

[Killed] BlockStatement
src/domain/item-grouping.ts:112:75
 // Returns numeric buckets keyed by their aisle number plus a separate null bucket.
 const bucketByAisleKey = (
   items: TripItem[],
-): { numericBuckets: Map<number, TripItem[]>; nullBucket: TripItem[] } => {
-  const numericBuckets = new Map<number, TripItem[]>();
-  const nullBucket: TripItem[] = [];
-  for (const item of items) {
-    const aisle = item.storeLocation.aisleNumber;
-    if (aisle === null) {
-      nullBucket.push(item);
-      continue;
-    }
-    if (!numericBuckets.has(aisle)) {
-      numericBuckets.set(aisle, []);
-    }
-    numericBuckets.get(aisle)!.push(item);
-  }
-  return { numericBuckets, nullBucket };
-};
+): { numericBuckets: Map<number, TripItem[]>; nullBucket: TripItem[] } => {};
 
 const distinctAisleKeyCount = (
killedBy: US-08: Area completion and sweep progress in UI shows completion badge and progress bar after marking area done
statusReason: TypeError: Cannot read properties of undefined (reading 'numericBuckets')

[Killed] BlockStatement
src/domain/item-grouping.ts:115:29
 ): { numericBuckets: Map<number, TripItem[]>; nullBucket: TripItem[] } => {
   const numericBuckets = new Map<number, TripItem[]>();
   const nullBucket: TripItem[] = [];
-  for (const item of items) {
-    const aisle = item.storeLocation.aisleNumber;
-    if (aisle === null) {
-      nullBucket.push(item);
-      continue;
-    }
-    if (!numericBuckets.has(aisle)) {
-      numericBuckets.set(aisle, []);
-    }
-    numericBuckets.get(aisle)!.push(item);
-  }
+  for (const item of items) {}
   return { numericBuckets, nullBucket };
 };
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] EqualityOperator
src/domain/item-grouping.ts:117:9
   const nullBucket: TripItem[] = [];
   for (const item of items) {
     const aisle = item.storeLocation.aisleNumber;
-    if (aisle === null) {
+    if (aisle !== null) {
       nullBucket.push(item);
       continue;
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/domain/item-grouping.ts:117:9
   const nullBucket: TripItem[] = [];
   for (const item of items) {
     const aisle = item.storeLocation.aisleNumber;
-    if (aisle === null) {
+    if (true) {
       nullBucket.push(item);
       continue;
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/domain/item-grouping.ts:121:37
       nullBucket.push(item);
       continue;
     }
-    if (!numericBuckets.has(aisle)) {
-      numericBuckets.set(aisle, []);
-    }
+    if (!numericBuckets.has(aisle)) {}
     numericBuckets.get(aisle)!.push(item);
   }
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/domain/item-grouping.ts:121:9
       nullBucket.push(item);
       continue;
     }
-    if (!numericBuckets.has(aisle)) {
+    if (false) {
       numericBuckets.set(aisle, []);
     }
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: TypeError: Cannot read properties of undefined (reading 'push')

[Killed] ArrowFunction
src/domain/item-grouping.ts:129:31
   return { numericBuckets, nullBucket };
 };
 
-const distinctAisleKeyCount = (
-  numericBuckets: Map<number, TripItem[]>,
-  nullBucket: TripItem[],
-): number => numericBuckets.size + (nullBucket.length > 0 ? 1 : 0);
+const distinctAisleKeyCount = () => undefined;
 
 // Partitions a SectionGroup into per-aisle sub-groups.
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Found multiple elements with text: 1 of 3

[Killed] ConditionalExpression
src/domain/item-grouping.ts:132:37
 const distinctAisleKeyCount = (
   numericBuckets: Map<number, TripItem[]>,
   nullBucket: TripItem[],
-): number => numericBuckets.size + (nullBucket.length > 0 ? 1 : 0);
+): number => numericBuckets.size + (true ? 1 : 0);
 
 // Partitions a SectionGroup into per-aisle sub-groups.
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Found multiple elements with text: 1 of 3

[Killed] EqualityOperator
src/domain/item-grouping.ts:132:37
 const distinctAisleKeyCount = (
   numericBuckets: Map<number, TripItem[]>,
   nullBucket: TripItem[],
-): number => numericBuckets.size + (nullBucket.length > 0 ? 1 : 0);
+): number => numericBuckets.size + (nullBucket.length >= 0 ? 1 : 0);
 
 // Partitions a SectionGroup into per-aisle sub-groups.
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Found multiple elements with text: 1 of 3

[Killed] BlockStatement
src/domain/item-grouping.ts:141:30
 // null-keyed tail. Pure function; no React, no IO.
 export const partitionSectionByAisle = (
   group: SectionGroup,
-): AisleSubGroup[] | null => {
-  const { numericBuckets, nullBucket } = bucketByAisleKey(group.items);
-
-  if (distinctAisleKeyCount(numericBuckets, nullBucket) <= 1) {
-    return null;
-  }
-
-  const ascendingNumericKeys = [...numericBuckets.keys()].sort((a, b) => a - b);
-  const numericSubGroups = ascendingNumericKeys.map((key) =>
-    createAisleSubGroup(key, numericBuckets.get(key)!),
-  );
-
-  if (nullBucket.length === 0) {
-    return numericSubGroups;
-  }
-  return [...numericSubGroups, createAisleSubGroup(null, nullBucket)];
-};
+): AisleSubGroup[] | null => {};
 
 const isStaple = (item: TripItem): boolean => item.itemType !== 'one-off';
killedBy: US-08: Area completion and sweep progress in UI shows completion badge and progress bar after marking area done
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
src/domain/item-grouping.ts:144:7
 ): AisleSubGroup[] | null => {
   const { numericBuckets, nullBucket } = bucketByAisleKey(group.items);
 
-  if (distinctAisleKeyCount(numericBuckets, nullBucket) <= 1) {
+  if (false) {
     return null;
   }
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Found multiple elements with text: 1 of 3

[Killed] EqualityOperator
src/domain/item-grouping.ts:144:7
 ): AisleSubGroup[] | null => {
   const { numericBuckets, nullBucket } = bucketByAisleKey(group.items);
 
-  if (distinctAisleKeyCount(numericBuckets, nullBucket) <= 1) {
+  if (distinctAisleKeyCount(numericBuckets, nullBucket) < 1) {
     return null;
   }
killedBy: US-10: Store section navigation and progress in UI shows checked count per store section
statusReason: Error: Found multiple elements with text: 1 of 3

[Survived] MethodExpression
src/domain/item-grouping.ts:148:32
     return null;
   }
 
-  const ascendingNumericKeys = [...numericBuckets.keys()].sort((a, b) => a - b);
+  const ascendingNumericKeys = [...numericBuckets.keys()];
   const numericSubGroups = ascendingNumericKeys.map((key) =>
     createAisleSubGroup(key, numericBuckets.get(key)!),

[Survived] ArrowFunction
src/domain/item-grouping.ts:148:64
     return null;
   }
 
-  const ascendingNumericKeys = [...numericBuckets.keys()].sort((a, b) => a - b);
+  const ascendingNumericKeys = [...numericBuckets.keys()].sort(() => undefined);
   const numericSubGroups = ascendingNumericKeys.map((key) =>
     createAisleSubGroup(key, numericBuckets.get(key)!),

[Killed] ArrowFunction
src/domain/item-grouping.ts:149:53
   }
 
   const ascendingNumericKeys = [...numericBuckets.keys()].sort((a, b) => a - b);
-  const numericSubGroups = ascendingNumericKeys.map((key) =>
-    createAisleSubGroup(key, numericBuckets.get(key)!),
+  const numericSubGroups = ascendingNumericKeys.map(() => undefined,
   );
 
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: TypeError: Cannot read properties of undefined (reading 'aisleKey')

[Killed] EqualityOperator
src/domain/item-grouping.ts:153:7
     createAisleSubGroup(key, numericBuckets.get(key)!),
   );
 
-  if (nullBucket.length === 0) {
+  if (nullBucket.length !== 0) {
     return numericSubGroups;
   }
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    "aisle-subgroup-4",
    "aisle-subgroup-5",

[Killed] ConditionalExpression
src/domain/item-grouping.ts:153:7
     createAisleSubGroup(key, numericBuckets.get(key)!),
   );
 
-  if (nullBucket.length === 0) {
+  if (false) {
     return numericSubGroups;
   }
killedBy: AisleSection — slice 01 render branches (US-01) multi-aisle section renders divider + badge per aisle group
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

  Array [
    "aisle-subgroup-4",
    "aisle-subgroup-5",

[Killed] ArrayDeclaration
src/domain/item-grouping.ts:156:10
   if (nullBucket.length === 0) {
     return numericSubGroups;
   }
-  return [...numericSubGroups, createAisleSubGroup(null, nullBucket)];
+  return [];
 };
 
killedBy: AisleSection — slice 01 render branches (US-01) mixed section places `No aisle` tail at the end
statusReason: Error: Unable to find an element with testID: /^aisle-subgroup-/

<View
  testID="aisle-section-Inner Aisles"
>
  <View>
    <Text>
      Inner Aisles

[Killed] EqualityOperator
src/domain/item-grouping.ts:159:47
   return [...numericSubGroups, createAisleSubGroup(null, nullBucket)];
 };
 
-const isStaple = (item: TripItem): boolean => item.itemType !== 'one-off';
+const isStaple = (item: TripItem): boolean => item.itemType === 'one-off';
 
 export const groupByArea = (items: TripItem[], areas: readonly string[]): AreaGroup[] => {
killedBy: US-07: Skip Staple This Trip skips a staple without removing from the library
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/domain/item-grouping.ts:159:47
   return [...numericSubGroups, createAisleSubGroup(null, nullBucket)];
 };
 
-const isStaple = (item: TripItem): boolean => item.itemType !== 'one-off';
+const isStaple = (item: TripItem): boolean => true;
 
 export const groupByArea = (items: TripItem[], areas: readonly string[]): AreaGroup[] => {
killedBy: UI-WS-2: Quick-add places a new item on the trip adds a quick-add item that appears on the home screen
statusReason: Error: Found multiple elements with text: Greek yogurt

[Killed] BlockStatement
src/domain/item-grouping.ts:161:90
 
 const isStaple = (item: TripItem): boolean => item.itemType !== 'one-off';
 
-export const groupByArea = (items: TripItem[], areas: readonly string[]): AreaGroup[] => {
-  const stapleItems = items.filter(isStaple);
-  const itemsByArea = stapleItems.reduce<Record<string, TripItem[]>>(
-    (groups, item) => ({
-      ...groups,
-      [item.houseArea]: [...(groups[item.houseArea] ?? []), item],
-    }),
-    {}
-  );
-
-  return areas.map((area) =>
-    createAreaGroup(area, itemsByArea[area] ?? [])
-  );
-};
+export const groupByArea = (items: TripItem[], areas: readonly string[]): AreaGroup[] => {};
 
 export const getOneOffItems = (items: TripItem[]): TripItem[] =>
killedBy: UI-WS-1: Home view shows staples organized by house area displays staples under their house area headings
statusReason: TypeError: Cannot read properties of undefined (reading 'map')
