[Killed] MethodExpression
src/domain/item-grouping.ts:162:23
 const isStaple = (item: TripItem): boolean => item.itemType !== 'one-off';
 
 export const groupByArea = (items: TripItem[], areas: readonly string[]): AreaGroup[] => {
-  const stapleItems = items.filter(isStaple);
+  const stapleItems = items;
   const itemsByArea = stapleItems.reduce<Record<string, TripItem[]>>(
     (groups, item) => ({
killedBy: UI-WS-2: Quick-add places a new item on the trip adds a quick-add item that appears on the home screen
statusReason: Error: Found multiple elements with text: Greek yogurt

[Killed] ArrowFunction
src/domain/item-grouping.ts:164:5
 export const groupByArea = (items: TripItem[], areas: readonly string[]): AreaGroup[] => {
   const stapleItems = items.filter(isStaple);
   const itemsByArea = stapleItems.reduce<Record<string, TripItem[]>>(
-    (groups, item) => ({
-      ...groups,
-      [item.houseArea]: [...(groups[item.houseArea] ?? []), item],
-    }),
+    () => undefined,
     {}
   );
killedBy: UI-WS-1: Home view shows staples organized by house area displays staples under their house area headings
statusReason: TypeError: Cannot read properties of undefined (reading 'Bathroom')

[Killed] LogicalOperator
src/domain/item-grouping.ts:166:30
   const itemsByArea = stapleItems.reduce<Record<string, TripItem[]>>(
     (groups, item) => ({
       ...groups,
-      [item.houseArea]: [...(groups[item.houseArea] ?? []), item],
+      [item.houseArea]: [...(groups[item.houseArea] && []), item],
     }),
     {}
killedBy: UI-WS-1: Home view shows staples organized by house area displays staples under their house area headings
statusReason: TypeError: undefined is not iterable (cannot read property Symbol(Symbol.iterator))

[Killed] ArrayDeclaration
src/domain/item-grouping.ts:166:56
   const itemsByArea = stapleItems.reduce<Record<string, TripItem[]>>(
     (groups, item) => ({
       ...groups,
-      [item.houseArea]: [...(groups[item.houseArea] ?? []), item],
+      [item.houseArea]: [...(groups[item.houseArea] ?? ["Stryker was here"]), item],
     }),
     {}
killedBy: groupByArea excludes one-offs from area groups area groups contain only staple items when mix of staples and one-offs provided
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 1
Received length: 2
Received array:  ["Stryker was here", {"checked": false, "checkedAt": null, "houseArea": "Fridge", "id": "s1", "itemType": "staple", "name": "Milk", "needed": true, "source": "preloaded", "stapleId": "staple-1", "storeLocation": {"aisleNumber": 2, "section": "Dairy"}}]

[Killed] ArrowFunction
src/domain/item-grouping.ts:171:20
     {}
   );
 
-  return areas.map((area) =>
-    createAreaGroup(area, itemsByArea[area] ?? [])
+  return areas.map(() => undefined
   );
 };
killedBy: Reset Sweep button HomeView shows a Reset Sweep button
statusReason: TypeError: Cannot read properties of undefined (reading 'area')

[Killed] LogicalOperator
src/domain/item-grouping.ts:172:27
   );
 
   return areas.map((area) =>
-    createAreaGroup(area, itemsByArea[area] ?? [])
+    createAreaGroup(area, itemsByArea[area] && [])
   );
 };
killedBy: Reset Sweep button HomeView shows a Reset Sweep button
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] ArrowFunction
src/domain/item-grouping.ts:176:31
   );
 };
 
-export const getOneOffItems = (items: TripItem[]): TripItem[] =>
-  items.filter((item) => item.itemType === 'one-off');
+export const getOneOffItems = () => undefined;
 
killedBy: WS-1: Maria signs out and returns to the login screen takes Maria from the authenticated shell back to the login screen when she taps Sign out
statusReason: Error: Unable to find node on an unmounted component.

[Killed] EqualityOperator
src/domain/item-grouping.ts:177:26
 };
 
 export const getOneOffItems = (items: TripItem[]): TripItem[] =>
-  items.filter((item) => item.itemType === 'one-off');
+  items.filter((item) => item.itemType !== 'one-off');
 
killedBy: Reset Sweep button confirming Reset Sweep resets the trip and refreshes the view
statusReason: Error: Unable to find an element with text: Birthday candles

<View
  testID="safe-area"
>
  <View>
    <View
      accessible={true}

[Killed] ArrowFunction
src/domain/item-grouping.ts:177:16
 };
 
 export const getOneOffItems = (items: TripItem[]): TripItem[] =>
-  items.filter((item) => item.itemType === 'one-off');
+  items.filter(() => undefined);
 
killedBy: groupByArea excludes one-offs from area groups getOneOffItems returns only one-off items
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []
